=============
basic
=============

%option noyywrap

digit   [0-9]

%%

%%

-------------

(source_file
  (section1
    (alias
      (identifier)
      (rule))
    (alias
      (identifier)
      (rule)))
  (section2))

=============
comments
=============

/* a comment */

%{
#include "y.tab.h"
%}

%p 6000 /* set positions to 6000 */
%option noyywrap

/* even more comments wow */

%%

"+"                  { return PLUS;       }
"-"                  { return MINUS;      }
\n                   /* more stuff */
[ \t\r]              /* skip whitespace */

%%

-------------

(source_file
  (section1
    (comment)
    (prologue
      (embedded_code))
    (alias
      (identifier)
      (rule))
    (comment)
    (alias
      (identifier)
      (rule))
    (comment))
  (section2
    (declaration
      (string)
      (embedded_code))
    (declaration
      (string)
      (embedded_code))
    (declaration
      (rule)
      (comment))
    (declaration
      (rule))
    (declaration
      (rule)
      (comment))))

=============
embedded_code
=============

%{
#include "y.tab.h"
%}

%p 6000 /* set positions to 6000 */

%%

""                   { return THE_VOID;   }
"+"                  { return PLUS;       }

%%

int thing() {
    return true;
}

-------------

(source_file
  (section1
    (prologue
      (embedded_code))
    (alias
      (identifier)
      (rule))
    (comment))
  (section2
    (declaration
      (string)
      (embedded_code))
    (declaration
      (string)
      (embedded_code)))
  (embedded_code))

=============
states
=============

%{
#include "y.tab.h"
%}

%x COMMENT

%%

"/*"                       { BEGIN(COMMENT); }
<COMMENT>([^*]|\*[^/])*    /* */
<COMMENT>\n.*              { yycolumn = 1;
                             yyless(1); }
<COMMENT>"*/"              { BEGIN(INITIAL); }

%%

-------------

(source_file
  (section1
    (prologue
      (embedded_code))
    (alias
      (identifier)
      (rule)))
  (section2
    (declaration
      (string)
      (embedded_code))
    (declaration
      (state
        (identifier))
      (rule)
      (comment))
    (declaration
      (state
        (identifier))
      (rule)
      (embedded_code))
    (declaration
      (state
        (identifier))
      (string)
      (embedded_code))))
