==================
basic
==================

%option noyywrap

digit   [0-9]

%%

%%

------------------

(source_file
  (section1
    (alias
      (identifier)
      (rule))
    (alias
      (identifier)
      (rule)))
  (section2))

==================
comments
==================

/* a comment */

%{
#include "y.tab.h"
%}

%p /* one */ /* two */ 6000 /* set positions to 6000 */
/* another comment */
%option noyywrap 

/* even more comments wow */

%%

"+"      /* + */ /* + */  { return PLUS;    } /* + */
"-"      /* - */          { return MINUS;   } /* - */ /* + */
"//".+                    { return COMMENT; }

\n
[ \t\r]                   /* skip whitespace */

%%

------------------

(source_file
  (section1
    (comment)
    (prologue
      (embedded_code))
    (alias
      (identifier)
      (comment)
      (comment)
      (rule))
    (comment)
    (comment)
    (alias
      (identifier)
      (rule))
    (comment))
  (section2
    (declaration
      (rule
        (string))
      (comment)
      (comment)
      (embedded_code)
      (comment))
    (declaration
      (rule
        (string))
      (comment)
      (embedded_code)
      (comment)
      (comment))
    (declaration
      (rule
        (string))
      (embedded_code))
    (declaration
      (rule
        (escaped)))
    (declaration
      (rule
        (escaped)
        (escaped))
      (comment))))

==================
embedded_code
==================

%{
#include "y.tab.h"
%}

%p 6000 /* set positions to 6000 */

%%

""                   { return THE_VOID;   }
"+"                  { return PLUS;       }

%%

int thing() {
    return true;
}

------------------

(source_file
  (section1
    (prologue
      (embedded_code))
    (alias
      (identifier)
      (rule))
    (comment))
  (section2
    (declaration
      (rule
        (string))
      (embedded_code))
    (declaration
      (rule
        (string))
      (embedded_code)))
  (embedded_code))

==================
states
==================

%{
#include "y.tab.h"
%}

%x COMMENT

%%


"/*"                       { BEGIN(COMMENT); }
<COMMENT>([^*]|\*[^/])*    /* */
<COMMENT>\n.*              { yycolumn = 1;
                             yyless(1); }
<COMMENT>"*/"              { BEGIN(INITIAL); }

%%

------------------

(source_file
  (section1
    (prologue
      (embedded_code))
    (alias
      (identifier)
      (rule)))
  (section2
    (declaration
      (rule
        (string))
      (embedded_code))
    (declaration
      (state
        (identifier))
      (rule
        (escaped))
      (comment))
    (declaration
      (state
        (identifier))
      (rule
        (escaped))
      (embedded_code))
    (declaration
      (state
        (identifier))
      (rule
        (string))
      (embedded_code))))

==================
more complex rules
==================

digit         [0-9]
letter        [a-zA-Z]

%%

[]              /* technically not valid, but a pretty common state while typing */
[0-9]+\.[0-9]+  { return FLOAT; }
[ \t]           { return WHITESPACE; }
{letter}({letter}|{digit})* {
                       yylval.id = strdup(yytext);
                       return IDENT;      }
%%

------------------

(source_file
  (section1
    (alias
      (identifier)
      (rule))
    (alias
      (identifier)
      (rule)))
  (section2
    (declaration
      (rule)
      (comment))
    (declaration
      (rule
        (escaped))
      (embedded_code))
    (declaration
      (rule
        (escaped))
      (embedded_code))
    (declaration
      (rule
        (interpolation
          (identifier))
        (interpolation
          (identifier))
        (interpolation
          (identifier)))
      (embedded_code))))
